ka2_2024/src/Documents/ЗапросНаИнформационноеОбслуживаниеНалогоплательщика/ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросНаИнформационноеОбслуживаниеНалогоплательщика</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУслуги</name>
    <type>
      <types>EnumRef.ВидыУслугПриИОН</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматОтвета</name>
    <type>
      <types>EnumRef.ФорматОтветаНаЗапросИОН</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПредставленияСправки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйПараметр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматЗапроса</name>
    <type>
      <types>EnumRef.ФорматыДокументооборотаСФНС</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНалогов</name>
    <type>
      <types>EnumRef.КоличествоЭлементовДляСверкиИОН</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСверки</name>
    <type>
      <types>EnumRef.ТипыСверокИОН</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеталСвед</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнфПрНач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчСуммПени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеталНачСумм</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКПП</name>
    <type>
      <types>EnumRef.КоличествоЭлементовДляСверкиИОН</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОКТМО</name>
    <type>
      <types>EnumRef.КоличествоЭлементовДляСверкиИОН</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрПредДетал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапрашиваемыеНалоги</name>
    <attributes>
      <name>КБК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОКАТО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Налог</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПереченьОКТМО</name>
    <attributes>
      <name>ОКТМО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПереченьКПП</name>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ka2_2024/src/Enums/КоличествоЭлементовДляСверкиИОН/КоличествоЭлементовДляСверкиИОН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КоличествоЭлементовДляСверкиИОН</name>
  <enumValues>
    <name>Один</name>
  </enumValues>
  <enumValues>
    <name>Несколько</name>
  </enumValues>
  <enumValues>
    <name>Все</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Catalogs/РегистрацииВНалоговомОргане/РегистрацииВНалоговомОргане.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РегистрацииВНалоговомОргане</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Доверенность</name>
    <comment>Доверенность налогоплательщика на представителя</comment>
    <type>
      <types>CatalogRef.ДоверенностиНалогоплательщика</types>
      <types>CatalogRef.МашиночитаемыеДоверенностиФНС</types>
      <types>CatalogRef.МашиночитаемыеДоверенностиРаспределенныйРеестр</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПредставителя</name>
    <comment>Название документа, подтверждающего полномочия представителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойИндексОбособленногоПодразделения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>Код причины постановки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеИФНС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОбособленногоПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Представитель</name>
    <comment>Представитель в территориальном органе ФНС</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УполномоченноеЛицоПредставителя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодРегиона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСлужебное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПостановкиНаУчет</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСнятияСУчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <comment>Филиал / ГО</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КрупнейшийНалогоплательщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подписанты</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Доверенность</name>
      <comment>Доверенность налогоплательщика на представителя</comment>
      <type>
        <types>CatalogRef.ДоверенностиНалогоплательщика</types>
        <types>CatalogRef.МашиночитаемыеДоверенностиФНС</types>
        <types>CatalogRef.МашиночитаемыеДоверенностиРаспределенныйРеестр</types>
      </type>
    </attributes>
    <attributes>
      <name>Представитель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УполномоченноеЛицоПредставителя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПредставителя</name>
      <comment>Название документа, подтверждающего полномочия представителя</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ka2_2024/src/Documents/ЗапросНаИнформационноеОбслуживаниеНалогоплательщика/Forms/ФормаВыбораОКТМО/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Свойства = "ТипСверки, ВидУслуги, Организация, КоличествоОКТМО, УИДРодителя";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, Свойства);
	КоличествоОКТМО = Строка(Параметры.КоличествоОКТМО);
	ТаблицаИзАдресаВРеквизит(Параметры.Адрес);
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаИзАдресаВРеквизит(Адрес)

	Таблица = ПолучитьИзВременногоХранилища(Адрес);
	ЗначениеВРеквизитФормы(Таблица, "ПереченьОКТМО");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КоличествоВсеПриИзменении(Элемент)
	
	ПереченьОКТМО.Очистить();
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоОдинПриИзменении(Элемент)
	
	ПереченьОКТМО.Очистить();
	ПереченьОКТМО.Добавить();
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоНесколькоПриИзменении(Элемент)
	
	ПереченьОКТМО.Очистить();
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ОКТМОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыбратьИзРегистрации("ОКТМО", "КодПоОКТМО");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)

	Результат = Новый Структура();
	Результат.Вставить("НовоеКоличествоОКТМО", ПредопределенноеЗначение("Перечисление.КоличествоЭлементовДляСверкиИОН." + КоличествоОКТМО));
	Результат.Вставить("Адрес", АдресТаблицы());
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Подобрать(Команда)
	
	ВыбратьИзРегистрации("ОКТМО", "КодПоОКТМО");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	ЭтоВсе  = КоличествоОКТМО = НСтр("ru = 'Все'");
	ЭтоОдин = КоличествоОКТМО = НСтр("ru = 'Один'");
	ЭтоНесколько = КоличествоОКТМО = НСтр("ru = 'Несколько'");
	
	Элементы.ОКТМО.Видимость = ЭтоОдин;
	
	Если ЭтоНесколько Тогда
		Элементы.СтраницыНесколько.ТекущаяСтраница = Элементы.СтраницаТаблица;
	Иначе
		Элементы.СтраницыНесколько.ТекущаяСтраница = Элементы.СтраницаПустая;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПеренумероватьСтроки(Таблица)
	
	НомерСтроки = 1;
	Для каждого СтрокаТаблицы Из Таблица Цикл
		СтрокаТаблицы.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция АдресТаблицы()

	Таблица = ПереченьОКТМО.Выгрузить();
	Адрес = ПоместитьВоВременноеХранилище(Таблица, УИДРодителя);
	
	Возврат Адрес;

КонецФункции

&НаКлиенте
Процедура ВыбратьИзРегистрации(Имя, ПолеРегистрации)
	
	ЗначениеОтбора = Новый Структура("Владелец", Организация);
	ВходящийКонтекст = Новый Структура("Отбор", ЗначениеОтбора);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Имя", Имя);
	ДополнительныеПараметры.Вставить("ПолеРегистрации", ПолеРегистрации);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ВыбратьИзРегистрации_Завершение", 
		ЭтотОбъект, 
		ДополнительныеПараметры);

	ОткрытьФорму("Справочник.РегистрацииВНалоговомОргане.ФормаВыбора", ВходящийКонтекст,,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзРегистрации_Завершение(Результат, ВходящийКонтекст) Экспорт
	
	ДобавитьВТаблицуИзРегистраций(Результат, ВходящийКонтекст.Имя, ВходящийКонтекст.ПолеРегистрации);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВТаблицуИзРегистраций(Регистрации, Имя, ПолеРегистрации) Экспорт
	
	Если ТипЗнч(Регистрации) = Тип("Массив") Тогда
		
		Для каждого Регистрация Из Регистрации Цикл
		
			ДобавитьВТаблицуИзРегистрации(Регистрация, Имя, ПолеРегистрации);
		
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Регистрации) = Тип("СправочникСсылка.РегистрацииВНалоговомОргане") Тогда
		
		ДобавитьВТаблицуИзРегистрации(Регистрации, Имя, ПолеРегистрации);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВТаблицуИзРегистрации(Регистрация, Имя, ПолеРегистрации) Экспорт
	
	НовоеЗначение = Регистрация[ПолеРегистрации];
	
	Если ЗначениеЗаполнено(НовоеЗначение) Тогда
		
		Если КоличествоОКТМО = "Один" Тогда
			
			// Чтобы 2,3 и т.д. строки в таблицу не добавлялись
			ПереченьОКТМО.Очистить();
			ДобавитьСтрокуТаблицыОКТМО(НовоеЗначение);
			
		Иначе
			Отбор = Новый Структура();
			Отбор.Вставить(Имя, НовоеЗначение);
			
			НайденныеСтроки = ПереченьОКТМО.НайтиСтроки(Отбор);
				
			Если НайденныеСтроки.Количество() = 0 Тогда
				
				ДобавитьСтрокуТаблицыОКТМО(НовоеЗначение);
				
			Иначе
				
				Текст = НСтр("ru = '%1 %2 не добавлено, поскольку уже есть в таблице'");
				Текст = СтрШаблон(Текст, Имя, НовоеЗначение);
				ОбщегоНазначения.СообщитьПользователю(Текст);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПеренумероватьСтроки(ПереченьОКТМО);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуТаблицыОКТМО(НовоеЗначение)
	
	НоваяСтрока = ПереченьОКТМО.Добавить();
	НоваяСтрока.ОКТМО = НовоеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереченьОКТМОПриИзменении(Элемент)
	ПеренумероватьСтроки(ПереченьОКТМО);
КонецПроцедуры


#КонецОбласти
